Revit 2027 API
ParameterTypeId.EnergyAnalysisGlazingIsShaded Property
 "Glazing is Shaded": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }
Public Shared ReadOnly Property EnergyAnalysisGlazingIsShaded As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisGlazingIsShaded {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisGlazingIsShaded : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace